<script setup lang="ts">
</script>

<template>
  <div class="hero">
    <img src="../../assets/BedrockBoot.Icon.256x.png" alt="Logo" width="180" height="180" />
    <h1>BedrockBoot</h1>
    <p>为 Windows 与 Linux 开发的基岩版启动器</p>

    <router-link to="/download" class="hero-btn" custom v-slot="{ navigate }">
      <button @click="navigate" class="border-btn">
        <svg t="1787244542283" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3915" width="18" height="18"><path d="M896 672c-17.066667 0-32 14.933333-32 32v128c0 6.4-4.266667 10.666667-10.666667 10.666667H170.666667c-6.4 0-10.666667-4.266667-10.666667-10.666667v-128c0-17.066667-14.933333-32-32-32s-32 14.933333-32 32v128c0 40.533333 34.133333 74.666667 74.666667 74.666667h682.666666c40.533333 0 74.666667-34.133333 74.666667-74.666667v-128c0-17.066667-14.933333-32-32-32z" p-id="3916"></path><path d="M488.533333 727.466667c6.4 6.4 14.933333 8.533333 23.466667 8.533333s17.066667-2.133333 23.466667-8.533333l213.333333-213.333334c12.8-12.8 12.8-32 0-44.8-12.8-12.8-32-12.8-44.8 0l-157.866667 157.866667V170.666667c0-17.066667-14.933333-32-32-32s-34.133333 14.933333-34.133333 32v456.533333L322.133333 469.333333c-12.8-12.8-32-12.8-44.8 0-12.8 12.8-12.8 32 0 44.8l211.2 213.333334z" p-id="3917"></path></svg>
        <p>立即下载</p>
      </button>
    </router-link>

    <a href="https://github.com/Round-Studio/BedrockBoot">
      <button class="hero-btn border-btn">
        <svg t="1787244314488" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2932" width="18" height="18"><path d="M512 42.666667A464.64 464.64 0 0 0 42.666667 502.186667 460.373333 460.373333 0 0 0 363.52 938.666667c23.466667 4.266667 32-9.813333 32-22.186667v-78.08c-130.56 27.733333-158.293333-61.44-158.293333-61.44a122.026667 122.026667 0 0 0-52.053334-67.413333c-42.666667-28.16 3.413333-27.733333 3.413334-27.733334a98.56 98.56 0 0 1 71.68 47.36 101.12 101.12 0 0 0 136.533333 37.973334 99.413333 99.413333 0 0 1 29.866667-61.44c-104.106667-11.52-213.333333-50.773333-213.333334-226.986667a177.066667 177.066667 0 0 1 47.36-124.16 161.28 161.28 0 0 1 4.693334-121.173333s39.68-12.373333 128 46.933333a455.68 455.68 0 0 1 234.666666 0c89.6-59.306667 128-46.933333 128-46.933333a161.28 161.28 0 0 1 4.693334 121.173333A177.066667 177.066667 0 0 1 810.666667 477.866667c0 176.64-110.08 215.466667-213.333334 226.986666a106.666667 106.666667 0 0 1 32 85.333334v125.866666c0 14.933333 8.533333 26.88 32 22.186667A460.8 460.8 0 0 0 981.333333 502.186667 464.64 464.64 0 0 0 512 42.666667" p-id="2933"></path></svg>
        <p>前往 Github</p>
      </button>
    </a>
  </div>

  <img class="img-card" src="../../assets/screenshots/bb.main.page.png" alt="BedrockBoot 主窗口"/>

  <div class="header">
    <h1>随心配</h1>
    <p>主题自由，由你定义</p>
  </div>

  <p>启动器内置丰富的个性化选项，你可以根据自己的使用习惯自由调整。</p>
  <p>在 Windows 下，开启"实况背景"后，启动器背景将自动同步当前桌面壁纸。如果你正在使用 Wallpaper Engine 等动态壁纸软件，启动器背景也会随之动态变化，视觉体验更加沉浸。</p>

  <div class="header">
    <h1>跨平台</h1>
    <p>Windows & Linux</p>
  </div>

  <p>基于 Avalonia 跨平台框架，BedrockBoot 目前已支持 Windows 与 Linux 双平台运行。</p>
  <p>在 Linux 系统中，我们通过 GDK-Proton 组件实现了对 GDK 类型 Minecraft 的兼容支持，包括登录功能在内，均可正常使用。</p>
</template>

<style scoped>
.hero {
  margin: 20% 0;
  display: flex;
  flex-direction: column;
  align-items: center;
  text-align: center;
  height: 100%;
}

.hero-btn {
  width: 360px;
  height: 36px;
  display: flex;
  align-items: center;
  justify-content: center;
  gap: 8px;
  padding: 24px 24px;
  margin-bottom: 8px;
}
</style>